# SetPenColorByClass

## Description
Procedure SetPenColorByClass sets the referenced object to use the class attribute pen colors.

```pascal
PROCEDURE SetPenColorByClass(h : HANDLE);
```

```python
def vs.SetPenColorByClass(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Sets so that the class pen colors are used for the object referenced by h.

## Version
Availability: from VectorWorks8.0

## Category
* Object Attributes